# Data Cleaning and Preparation

In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [6]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [10]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [11]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data[4] = NA
data
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [31]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.308228       NaN       NaN
1 -0.190481       NaN       NaN
2  2.212303       NaN  1.818595
3 -1.581531       NaN  0.552936
4  0.106061  3.927528 -0.255126
5  0.854137 -0.364807  0.131102
6 -0.697614  1.335649 -0.151039

In [33]:
df.dropna()
df.dropna(thresh=1)

          0         1         2
0 -1.308228       NaN       NaN
1 -0.190481       NaN       NaN
2  2.212303       NaN  1.818595
3 -1.581531       NaN  0.552936
4  0.106061  3.927528 -0.255126
5  0.854137 -0.364807  0.131102
6 -0.697614  1.335649 -0.151039

### Filling In Missing Data

In [34]:
df.fillna(0)

          0         1         2
0 -1.308228  0.000000  0.000000
1 -0.190481  0.000000  0.000000
2  2.212303  0.000000  1.818595
3 -1.581531  0.000000  0.552936
4  0.106061  3.927528 -0.255126
5  0.854137 -0.364807  0.131102
6 -0.697614  1.335649 -0.151039

In [35]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -1.308228  0.500000  0.000000
1 -0.190481  0.500000  0.000000
2  2.212303  0.500000  1.818595
3 -1.581531  0.500000  0.552936
4  0.106061  3.927528 -0.255126
5  0.854137 -0.364807  0.131102
6 -0.697614  1.335649 -0.151039

In [36]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.308228  0.000000  0.000000
1 -0.190481  0.000000  0.000000
2  2.212303  0.000000  1.818595
3 -1.581531  0.000000  0.552936
4  0.106061  3.927528 -0.255126
5  0.854137 -0.364807  0.131102
6 -0.697614  1.335649 -0.151039

In [37]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
df.fillna(method='ffill')
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.442938  0.941571  0.533364
1  0.356266 -0.010115  1.415753
2  0.566106 -0.010115  0.194788
3 -0.655054 -0.010115  3.176873
4  0.959533       NaN  3.176873
5 -1.104376       NaN  3.176873

In [38]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [39]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [41]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [42]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [44]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [ ]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

In [ ]:
data.replace(-999, np.nan)

In [ ]:
data.replace([-999, -1000], np.nan)

In [ ]:
data.replace([-999, -1000], [np.nan, 0])

In [ ]:
data.replace({-999: np.nan, -1000: 0})

### Renaming Axis Indexes

In [68]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [69]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [70]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [71]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [72]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [73]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [77]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [92]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [93]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [95]:
print(cats.codes)
print(cats.categories)
pd.value_counts(cats)

[0 0 0 1 0 0 2 1 3 2 2 1]
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

In [ ]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

In [85]:
data = np.random.rand(20)
print(data)
pd.cut(data, 4, precision=2)

[0.5328 0.1054 0.0459 0.622  0.8224 0.0551 0.798  0.2442 0.8035 0.2982
 0.4673 0.9328 0.9098 0.1299 0.5295 0.6192 0.6246 0.6468 0.3321 0.1142]

[(0.49, 0.71], (0.045, 0.27], (0.045, 0.27], (0.49, 0.71], (0.71, 0.93], ..., (0.49, 0.71], (0.49, 0.71], (0.49, 0.71], (0.27, 0.49], (0.045, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.045, 0.27] < (0.27, 0.49] < (0.49, 0.71] < (0.71, 0.93]]

In [90]:
data = np.random.randn(1000)  # Normally distributed
print(data)
cats = pd.qcut(data, 4)  # Cut into quartiles
print(cats)
print(pd.value_counts(cats))

[-0.054  -1.2954 -1.2373 -0.7475  0.0927 -0.2134  1.9269 -0.2963  1.6565
  0.0817 -0.4796 -0.4284  0.4315  0.1982 -0.3607 -0.35    0.1936  1.2912
  2.2758  1.1463  0.1566  0.4631 -0.5936  1.0315 -0.5032  1.1644  0.6346
 -0.9359 -0.3213 -1.3744 -0.6023 -0.2597  0.3919 -1.984  -0.3486 -0.9213
 -1.7791  1.3054 -0.1559  1.1402 -1.2247 -0.3338  0.5109 -0.5798  0.7189
 -0.2146  1.6707 -0.443   2.4022  1.583   0.6668  1.6288 -0.5344  1.6871
 -0.6221  0.5992  0.0212 -1.0012  0.3546  0.6104 -1.344  -0.2036 -1.1456
 -0.3521  0.5749  0.6808 -1.934   0.4878 -0.4332 -0.3694 -1.1399 -1.5107
 -0.3879 -0.7981  1.2575  1.4035 -0.7255 -0.6962 -0.0147 -0.7132 -0.8464
 -0.2161 -0.3377 -1.3088  0.0876 -0.6105  0.0261  1.2984 -0.9683  0.3371
 -0.7442 -0.9347 -0.9023  1.9469 -1.053   0.0249 -0.5781  0.1933  1.3978
  3.3666 -2.3722  0.851   1.3328  0.5134  1.0882  1.3461  0.5275 -0.9292
 -1.0659  1.058  -1.6723 -0.8679 -0.6179  0.604  -0.66   -0.8333 -0.0229
 -0.4106  0.7068  0.6703 -0.6305 -0.2003 -0.5447 -0.0873  1.0955 -0.2737
  1.1786 -2.136   1.1993  0.4436 -1.9397 -0.1865 -2.5295  1.8611  1.7247
  0.4506 -1.2943  0.0179 -1.8721  0.6997  0.5933  0.8583 -2.0494 -1.1461
 -0.0391 -0.4441 -0.4966  0.4069 -0.1825 -0.949   1.5535 -1.6652 -1.7292
  1.7312  0.0685  1.0614  0.1981 -0.1963 -1.5269  1.0097  1.0621  0.5463
 -0.9012  1.4607  0.7362 -0.2333  0.5605 -0.1463 -0.1113 -0.8413  1.0528
 -1.1839 -0.6094 -0.3701 -0.3049  0.0811  0.0788  1.0641 -0.1184 -0.1299
 -0.777  -0.4507 -0.3906 -0.7305 -0.5059  0.8258  0.9276 -0.8574  2.4656
  1.014  -0.3682 -1.9955  0.0289  0.0591  0.1924 -0.082   0.406   2.014
  1.924  -0.0074 -0.3421 -0.7441  1.1827 -0.2204  0.2298 -0.5746 -0.3969
 -0.334  -0.1414 -0.2979 -0.9485  0.1525 -1.0964  1.2244 -0.245  -0.8748
 -0.5737  1.1025  1.1791 -1.7846 -0.6992 -1.975   0.5707 -0.3618 -0.1522
  0.5464  1.0404 -1.602  -0.6118 -0.6187 -0.9702  0.8377 -0.6381 -0.2747
  1.2103 -0.3764  0.8582  0.9785  1.1763 -0.1876  1.5095 -1.0355  0.2008
 -2.9694  0.1475 -0.7423  0.4723  0.4629  0.4761  0.4449 -0.7921  0.4918
 -0.506  -0.4325  1.026  -1.3731  1.1729  0.9925 -0.7964  0.3493  2.2592
  2.0638  0.1991 -2.2763  0.7164 -1.5498  1.432  -1.0114  1.3166  0.5962
 -0.1018 -1.0931 -1.1882 -0.0154 -1.3118  1.3006 -0.4161  0.3182 -1.0649
 -0.3856 -0.367   0.9509 -0.2677  0.9567 -0.9693  0.1628 -1.2049  0.9526
 -1.6792  1.3885 -0.3436 -0.3131 -0.5873 -0.0576 -0.6844 -0.5845  2.3383
 -1.2252  0.0784 -0.9842 -0.3357 -0.1614 -0.1276 -1.7132  0.6797 -0.4911
 -1.1665  2.3307 -0.1782 -0.1568 -1.7858  0.732  -0.926   0.0986  1.6537
 -2.0916  0.2893  1.0563 -1.0678  0.7726  0.1528 -0.738  -0.7788  0.7215
  0.3553 -0.3487 -0.5125 -1.7639  0.0367 -1.0756  0.6299  0.1832  1.3924
 -2.2411  1.2457 -0.2118  0.2092 -1.4598 -0.4728  0.5864 -2.7487 -1.9367
 -1.2855 -0.2628 -0.4607 -0.5269 -0.0879 -0.2021  0.9171  0.9815  0.2807
 -0.5728 -0.5204 -0.7767 -0.9884  0.5372  0.1325  0.3614  1.3485 -0.7427
  1.1306  0.4827 -0.0519  0.7471  0.6823 -0.7285 -0.5469  0.101   0.1394
  0.0967 -0.3302  0.7284  0.3281  2.5311  0.4376 -0.9525  0.7922  0.1253
 -1.0243  1.1409  0.1133  0.2068 -1.4601 -1.5236 -0.5906 -0.3241  0.1323
  0.0979  1.2445 -0.0485 -1.0918 -0.7383  0.1159  0.0163 -1.2431 -1.9692
 -1.1414  0.4056 -0.5212 -0.8133 -0.4614  1.1597 -0.3077  0.6691  0.3974
  0.6125  1.3812 -0.0425  1.1821  0.153   0.0758  0.6157 -1.9923  0.963
  0.1025  0.3594  0.3558 -0.7994  1.1209 -0.2618 -0.4741 -0.112  -0.2852
 -0.1364  1.2856  0.7536  0.0534 -0.3554  0.7907  1.2748  0.2336 -1.316
  1.3961  0.3367  0.6049  0.6753 -0.0603  1.802  -0.3351 -0.7541  0.6507
  0.3654  1.3672 -0.1057 -0.0019  0.3168 -0.5125 -0.0527 -0.4572  2.4528
 -1.0509 -0.1721  0.853  -0.3563 -0.387   0.8816  1.0673  1.0797  1.6423
 -0.1037 -0.8829 -0.1974  1.3366  0.9268 -0.5271  0.6338  0.154  -0.5278
  0.8151 -0.6779 -1.4666  0.9571  0.3773 -0.3832  1.102   1.2211 -0.3265
  0.75    0.6041  1.0891  0.2512 -1.452   1.6531 -0.4785 -0.0107 -1.0609
 -1.5029 -1.9463  1.0136  0.0373  0.1333 -1.2931 -0.3225 -0.783  -0.3033
  0.09    0.2923  1.1777  0.8828  1.1508 -0.9972  0.0465 -0.6104 -0.395
  1.1999 -0.4518 -0.1554 -0.1535  0.0112 -0.0506  0.4202  1.191   1.5615
 -1.1329  0.0971 -1.0316 -0.0446 -0.2182  0.7729 -0.7286  0.2155 -2.0567
 -1.2487  1.267   0.722  -0.9546  0.9432  1.1927  1.0358  1.0314  0.1796
 -0.6252  1.7541  0.6651  0.9961  1.2541 -0.0716  1.1402 -0.1394  0.1301
  0.6734 -0.4392 -0.4501  1.5436 -0.1749 -1.767   1.3952 -0.7129  0.621
 -0.4906 -1.4165  0.2326  2.1624 -0.7037 -0.7037  0.8116  0.6842 -1.3384
  1.8807  1.3281 -0.3487 -0.5531  0.5024  1.5442 -0.5743  0.8905 -0.9757
  0.9369  0.0413 -0.4658 -0.4552  1.0002 -0.7215 -0.2212  2.2213 -0.3253
 -0.7586 -1.8349 -1.1077  0.9623 -0.3008  1.3017  1.0357  0.4782 -0.1841
 -1.3745  0.3274 -0.9445 -1.6703  0.3246  1.0325  1.0541 -1.2777  0.6446
  0.8068 -0.5045 -1.2271 -0.0238 -0.949  -1.5876  1.0026 -1.871   1.0768
 -0.5882 -0.3385 -0.2363 -1.4276 -1.4955 -1.2907 -0.3941 -0.9507  0.6195
 -0.1979 -1.5233 -0.8005 -0.3997 -1.0524  0.2256  1.0549  0.2155  0.1059
 -0.794   0.3253  0.3486  0.4909 -0.039   0.7839  0.6914  0.1813 -1.5614
  0.1359  0.3407  0.3253  1.0684  2.6117  0.5331 -0.3155 -1.0669  1.4977
 -0.5266 -1.1928 -1.7082  0.6557 -0.7935  0.0868 -0.1113  0.8716 -1.2389
  0.7697 -1.4737 -0.7379  0.3854 -2.4911 -1.2246  1.5231 -0.2696 -0.8796
  0.638  -0.7948 -0.5958  0.14   -0.3942 -0.47    0.623   0.4445  1.0371
 -0.8141 -1.8753  0.2893 -0.1274  1.3038  0.1982 -0.5185  0.233  -0.1016
 -0.0849 -0.1061 -0.0582  1.3852  1.5289  0.4209 -0.0722  0.5823 -0.6581
 -0.2074  3.5259  0.2831  0.5446  0.4622 -0.5691 -0.9984  1.9175  2.529
  0.5556 -0.2014  0.2238 -0.4259  0.0782 -0.2744 -0.2607 -1.2679 -0.1347
 -0.5172 -0.3404  1.0892  0.1294  1.0224 -0.4439 -0.6546  0.3473 -1.1347
  0.2375 -0.6679  2.6679  0.7368 -2.6658 -0.098   1.1965 -0.1218  0.3794
  1.3193  1.5538  0.9484  0.8487  0.6425 -0.9968  0.4279  0.6222 -1.9039
  0.8374  0.9166 -0.4762  0.5024  0.4893  0.1952  0.4403 -0.7499  0.2374
  0.9407 -1.4508  0.7208 -1.722   1.322   0.8594 -0.3411  0.3868 -0.3506
 -0.7517 -0.2999  0.2361 -0.7307 -0.3933 -0.6718 -0.4249 -1.1293 -0.966
  0.895   1.3878 -0.7011 -0.1243 -0.2062 -0.9784 -0.3461 -1.9048  0.7244
 -0.4507 -0.0803  0.5999 -3.6459  0.2555 -0.5496 -1.9075  0.4357  0.6791
 -0.9875  1.0672 -1.7224  0.6125 -1.7451 -0.5836 -1.0023  0.4642  0.0124
  1.6469 -0.0779  1.4414  1.1715  0.5766  0.2148 -1.8437  0.1723  1.3483
 -1.3445 -0.8874 -1.3756  0.0057  2.3553  2.1991 -0.7198 -1.082  -1.8945
 -0.164  -0.1252  0.0442  0.918   1.5782 -0.1598  0.2873 -0.9615  0.126
  0.3905  1.0519  1.5373 -0.0238  1.2664  0.2307  0.009  -0.4174  2.0448
  1.2364  1.6826  0.8594  1.001   0.3691  1.2091  1.0124  0.1003  1.0174
 -1.0911  0.6707  0.6922  0.3651  1.5563  0.5638  0.2431  0.4645  0.3871
 -0.3291 -0.0486  0.586   0.1286  1.4045 -0.7627 -0.4379  0.1226  0.5397
 -0.6964  1.3125 -1.2576  1.3271 -0.4813 -0.2539 -0.2813 -0.6235  0.1168
 -0.022  -0.6788 -0.3638 -1.1586  0.4179  0.2052  1.5828 -0.1632  0.6188
  0.3956 -1.2293  0.7504  0.1999 -0.6349 -0.0408  1.4954 -0.6987  0.5811
 -0.5492 -0.2053  0.3166  0.0135  1.7697 -1.5534  0.0303 -0.4416  1.5625
  0.0305 -0.7003 -0.0016 -0.1342 -0.3396 -1.0049  0.9332  0.1821 -0.0407
  0.1514  1.1858  0.2748 -0.2035  0.5892 -0.2861 -0.5176  0.6106  0.8531
  0.3918 -2.9708  0.699   0.2798 -0.122   0.2388  0.7924 -0.1141  0.0934
  0.3536 -0.1885 -0.328   0.0208  0.1735  0.3842 -0.4391 -0.8071 -0.362
  1.1956 -1.0634  2.175   1.3343  1.5716  0.3039 -0.367   0.8476 -0.1296
  0.4724 -0.0449  0.7575 -0.7589  0.247  -0.6914  0.2399 -0.2093  2.3096
  1.0785 -0.8129 -0.0194  0.6561 -0.0926  0.6074 -1.135  -2.0335  0.0278
 -0.6172 -0.7738  0.4356 -0.5654 -0.9551  0.4298  0.7593  1.2428 -1.7552
  0.276   0.3013  1.1978 -1.2242  0.6535 -0.1102 -0.2257 -0.9032  1.0718
 -0.4573  0.1764 -0.1155 -0.1238  1.1863 -0.5865  0.0879  0.1314  0.8387
  0.056  -0.5178 -0.2508  0.2693 -0.0071 -0.1787 -1.9942  1.633  -1.3066
 -0.7901 -0.7244 -1.3345 -1.4867 -0.6814  0.4057  0.6246  1.0987 -0.6889
 -1.4717 -0.12   -0.0842 -0.5263 -0.9719 -1.7263  0.094  -0.1435 -0.911
 -0.9416]
[(-0.613, -0.0234], (-3.647, -0.613], (-3.647, -0.613], (-3.647, -0.613], (-0.0234, 0.669], ..., (-3.647, -0.613], (-0.0234, 0.669], (-0.613, -0.0234], (-3.647, -0.613], (-3.647, -0.613]]
Length: 1000
Categories (4, interval[float64]): [(-3.647, -0.613] < (-0.613, -0.0234] < (-0.0234, 0.669] < (0.669, 3.526]]
(0.669, 3.526]       250
(-0.0234, 0.669]     250
(-0.613, -0.0234]    250
(-3.647, -0.613]     250
dtype: int64

In [91]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.225, -0.0234], (-3.647, -1.225], (-3.647, -1.225], (-1.225, -0.0234], (-0.0234, 1.243], ..., (-3.647, -1.225], (-0.0234, 1.243], (-1.225, -0.0234], (-1.225, -0.0234], (-1.225, -0.0234]]
Length: 1000
Categories (4, interval[float64]): [(-3.647, -1.225] < (-1.225, -0.0234] < (-0.0234, 1.243] < (1.243, 3.526]]

### Detecting and Filtering Outliers

In [96]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.006075    -0.008912    -0.052825    -0.035221
std       1.031490     1.006222     0.974728     1.000812
min      -3.183867    -3.481593    -3.194414    -3.108915
25%      -0.740508    -0.700074    -0.752792    -0.735438
50%       0.017170     0.023088    -0.054956    -0.031436
75%       0.696967     0.690303     0.617693     0.630775
max       3.189940     2.961194     3.023720     2.859053

In [97]:
col = data[2]
col[np.abs(col) > 3]

613   -3.194414
643    3.023720
Name: 2, dtype: float64

In [100]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
164  0.336788 -3.333767 -1.240685 -0.650855
246 -3.018842 -0.298748  0.406954  0.183282
270  0.781753 -0.555434 -0.048478 -3.108915
401 -3.183867  1.050471 -1.042736  1.680374
448 -3.140963 -1.509976 -0.389818 -0.273253
613  1.090038 -0.848098 -3.194414  0.077839
643  0.003349 -0.011807  3.023720 -1.105312
672  0.452649 -3.481593  0.789944  1.737746
841  3.082067 -0.516982  0.251909 -0.029354
869  3.189940  0.070978  0.516982 -0.805171

In [ ]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

In [ ]:
np.sign(data).head()

### Permutation and Random Sampling

In [ ]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

In [ ]:
df
df.take(sampler)

In [ ]:
df.sample(n=3)

In [ ]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

### Computing Indicator/Dummy Variables

In [105]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
print(df)
pd.get_dummies(df['key'])

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [117]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [118]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [122]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

D:\python\anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [147]:
all_genres = []
for genre in movies.genres:
    all_genres.extend(genre.split('|'))
print(len(all_genres))
genres = sorted(list(set((all_genres))))
# genres = pd.unique(all_genres)
print(genres)

6408
['Action', 'Adventure', 'Animation', "Children's", 'Comedy', 'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror', 'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']

In [153]:
zero_matrix = np.zeros((len(movies),len(genres)))
dummies = pd.DataFrame(zero_matrix,columns=genres)
print(dummies)

      Action  Adventure  Animation  Children's  Comedy  Crime  Documentary  \
0        0.0        0.0        0.0         0.0     0.0    0.0          0.0
1        0.0        0.0        0.0         0.0     0.0    0.0          0.0
2        0.0        0.0        0.0         0.0     0.0    0.0          0.0
3        0.0        0.0        0.0         0.0     0.0    0.0          0.0
4        0.0        0.0        0.0         0.0     0.0    0.0          0.0
...      ...        ...        ...         ...     ...    ...          ...
3878     0.0        0.0        0.0         0.0     0.0    0.0          0.0
3879     0.0        0.0        0.0         0.0     0.0    0.0          0.0
3880     0.0        0.0        0.0         0.0     0.0    0.0          0.0
3881     0.0        0.0        0.0         0.0     0.0    0.0          0.0
3882     0.0        0.0        0.0         0.0     0.0    0.0          0.0

      Drama  Fantasy  Film-Noir  Horror  Musical  Mystery  Romance  Sci-Fi  \
0       0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
1       0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
2       0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
3       0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
4       0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
...     ...      ...        ...     ...      ...      ...      ...     ...
3878    0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
3879    0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
3880    0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
3881    0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0
3882    0.0      0.0        0.0     0.0      0.0      0.0      0.0     0.0

      Thriller  War  Western
0          0.0  0.0      0.0
1          0.0  0.0      0.0
2          0.0  0.0      0.0
3          0.0  0.0      0.0
4          0.0  0.0      0.0
...        ...  ...      ...
3878       0.0  0.0      0.0
3879       0.0  0.0      0.0
3880       0.0  0.0      0.0
3881       0.0  0.0      0.0
3882       0.0  0.0      0.0

[3883 rows x 18 columns]

In [154]:
gen = movies.genres[2]
print(gen)
print(gen.split('|'))
dummies.columns.get_indexer(gen.split('|'))

Comedy|Romance
['Comedy', 'Romance']

array([ 4, 13], dtype=int64)

In [155]:
for i,gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0.0,0.0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0

In [158]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
print(movies_windic[:1])

   movie_id             title                       genres  Genre_Action  \
0         1  Toy Story (1995)  Animation|Children's|Comedy           0.0

   Genre_Adventure  Genre_Animation  Genre_Children's  Genre_Comedy  \
0              0.0              1.0               1.0           1.0

   Genre_Crime  Genre_Documentary  ...  Genre_Fantasy  Genre_Film-Noir  \
0          0.0                0.0  ...            0.0              0.0

   Genre_Horror  Genre_Musical  Genre_Mystery  Genre_Romance  Genre_Sci-Fi  \
0           0.0            0.0            0.0            0.0           0.0

   Genre_Thriller  Genre_War  Genre_Western
0             0.0        0.0            0.0

[1 rows x 21 columns]

In [108]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [109]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [110]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [111]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [112]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [114]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
print(movies_windic)
movies_windic.iloc[0]

      movie_id                               title  \
0            1                    Toy Story (1995)
1            2                      Jumanji (1995)
2            3             Grumpier Old Men (1995)
3            4            Waiting to Exhale (1995)
4            5  Father of the Bride Part II (1995)
...        ...                                 ...
3878      3948             Meet the Parents (2000)
3879      3949          Requiem for a Dream (2000)
3880      3950                    Tigerland (2000)
3881      3951             Two Family House (2000)
3882      3952               Contender, The (2000)

                            genres  Genre_Animation  Genre_Children's  \
0      Animation|Children's|Comedy              1.0               1.0
1     Adventure|Children's|Fantasy              0.0               1.0
2                   Comedy|Romance              0.0               0.0
3                     Comedy|Drama              0.0               0.0
4                           Comedy              0.0               0.0
...                            ...              ...               ...
3878                        Comedy              0.0               0.0
3879                         Drama              0.0               0.0
3880                         Drama              0.0               0.0
3881                         Drama              0.0               0.0
3882                Drama|Thriller              0.0               0.0

      Genre_Comedy  Genre_Adventure  Genre_Fantasy  Genre_Romance  \
0              1.0              0.0            0.0            0.0
1              0.0              1.0            1.0            0.0
2              1.0              0.0            0.0            1.0
3              1.0              0.0            0.0            0.0
4              1.0              0.0            0.0            0.0
...            ...              ...            ...            ...
3878           1.0              0.0            0.0            0.0
3879           0.0              0.0            0.0            0.0
3880           0.0              0.0            0.0            0.0
3881           0.0              0.0            0.0            0.0
3882           0.0              0.0            0.0            0.0

      Genre_Drama  ...  Genre_Crime  Genre_Thriller  Genre_Horror  \
0             0.0  ...          0.0             0.0           0.0
1             0.0  ...          0.0             0.0           0.0
2             0.0  ...          0.0             0.0           0.0
3             1.0  ...          0.0             0.0           0.0
4             0.0  ...          0.0             0.0           0.0
...           ...  ...          ...             ...           ...
3878          0.0  ...          0.0             0.0           0.0
3879          1.0  ...          0.0             0.0           0.0
3880          1.0  ...          0.0             0.0           0.0
3881          1.0  ...          0.0             0.0           0.0
3882          1.0  ...          0.0             1.0           0.0

      Genre_Sci-Fi  Genre_Documentary  Genre_War  Genre_Musical  \
0              0.0                0.0        0.0            0.0
1              0.0                0.0        0.0            0.0
2              0.0                0.0        0.0            0.0
3              0.0                0.0        0.0            0.0
4              0.0                0.0        0.0            0.0
...            ...                ...        ...            ...
3878           0.0                0.0        0.0            0.0
3879           0.0                0.0        0.0            0.0
3880           0.0                0.0        0.0            0.0
3881           0.0                0.0        0.0            0.0
3882           0.0                0.0        0.0            0.0

      Genre_Mystery  Genre_Film-Noir  Genre_Western
0               0.0              0.0            0.0
1               0.0              0.0            0.0
2               0.0              0.0            0.0
3               0.0              0.0            0.0
4               0.0              0.0            0.0
...             ...              ...            ...
3878            0.0              0.0            0.0
3879            0.0              0.0            0.0
3880            0.0              0.0            0.0
3881            0.0              0.0            0.0
3882            0.0              0.0            0.0

[3883 rows x 21 columns]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
Genre_Animation                               1
Genre_Children's                              1
                               ...
Genre_War                                     0
Genre_Musical                                 0
Genre_Mystery                                 0
Genre_Film-Noir                               0
Genre_Western                                 0
Name: 0, Length: 21, dtype: object

In [164]:
values = np.random.rand(10)
print(values)
bins = np.arange(0,1.1,0.2)
print(bins)

pd.get_dummies(pd.cut(values,bins))

[0.2059 0.6031 0.6272 0.7029 0.4926 0.8334 0.2949 0.6803 0.0107 0.9269]
[0.  0.2 0.4 0.6 0.8 1. ]

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           1           0           0           0
1           0           0           0           1           0
2           0           0           0           1           0
3           0           0           0           1           0
4           0           0           1           0           0
5           0           0           0           0           1
6           0           1           0           0           0
7           0           0           0           1           0
8           1           0           0           0           0
9           0           0           0           0           1

In [169]:
str1 = 'aabbaac'
str1.index('aac')

4

In [ ]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

## String Manipulation

### String Object Methods

In [ ]:
val = 'a,b,  guido'
val.split(',')

In [ ]:
pieces = [x.strip() for x in val.split(',')]
pieces

In [ ]:
first, second, third = pieces
first + '::' + second + '::' + third

In [ ]:
'::'.join(pieces)

In [ ]:
'guido' in val
val.index(',')
val.find(':')

In [ ]:
val.index(':')

In [ ]:
val.count(',')

In [ ]:
val.replace(',', '::')
val.replace(',', '')

### Regular Expressions

In [170]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [171]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [172]:
regex.findall(text)

['    ', '\t ', '  \t']

In [173]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [174]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [175]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [176]:
print(regex.match(text))

None

In [177]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [178]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [180]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [181]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [182]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [184]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
print(data)
data.isnull()

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [185]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [195]:
print(pattern)
x = data.str.findall(pattern, flags=re.IGNORECASE)

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

In [196]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [203]:
print(data.str.get(1))
data.str[0]

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [ ]:
data.str[:5]

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

In [206]:
data.str.count('e')

Dave     2.0
Steve    2.0
Rob      0.0
Wes      NaN
dtype: float64

## Conclusion